Repository: nmusatti/rust-overload
Catalog: slides/locale/*/LC_MESSAGES/index.po
Languages: it

source: Function Overloading in Rust - How I Learned to Live Happily Without it
it: Overload di funzioni in Rust - Come ho imparato a vivere felicemente senza

source: Rust Milano Meetup - 24 January 2018
it: Rust Milano Meetup - 24 gennaio 2018

source: Who I am
it: Chi sono

source: A long time C++ enthusiast who became disenchanted due to the ever increasing complexity of the language
it: Un appassionato di C++ di vecchia data, disilluso dalla complessità sempre maggiore del linguaggio

source: Doing Java and non programming stuff for a living
it: Lavoro in Java e su attività non di programmazione

source: A long time Rust beginner
it: Un principiante Rust di lungo corso

source: I also love Python!
it: Adoro anche Python!

source: What we are doing here
it: Cosa ci facciamo qui

source: What is function overloading and what is good about it
it: Cos'è l'overload di funzioni e cosa c'è di buono

source: What can be done when it is not available
it: Cosa si può fare quando non è supportato

source: Which of Rust's features can be used to address the same problems
it: Quali funzionalità di Rust possiamo usare per affrontare gli stessi problemi

source: Some further reaching implications
it: Alcune implicazioni di portata più ampia

source: A simple example
it: Un esempio semplice

source: A simple type: Element
it: Un tipo semplice: Element

source: An Element collection type: Collection
it: Un tipo collezione di Element: Collection

source: We want to add single elements to a collection
it: Vogliamo aggiungere singoli elementi a una collezione

source: We want to add all the elements in a collection to another collection
it: Vogliamo aggiungere ad una collezione tutti gli elementi di un'altra

source: How we would have done it in C
it: Come l'avremmo scritto in C

source: The same in Rust
it: Lo stesso in Rust

source: What's the problem
it: Qual è il problema

source: Reduced expressivity: I have to repeat type names just to disambiguate
it: Espressività ridotta: devo ripetere i nomi dei tipi solo per disambiguare

source: Names relate less directly to the problem domain
it: I nomi sono più distanti dal dominio del problema

source: Functions don't participate in generic code (C++ specific problem)
it: Le funzioni non possono essere invocate in modo generico (problema specifico C++)

source: A C++ version
it: Una versione C++

source: What is function overloading
it: Cos'è l'overload di funzioni

source: The possibility of *defining* two or more functions with the same name that take parameters that differ in type and/or number
it: La possibilità di *definire* due o più funzioni con lo stesso nome che prendono parametri che differiscono per tipo e/o numero

source: The possibility of *calling* a "function" with different type and/or number of arguments, regardless of how this is achieved
it: La possibilità di *chiamare* una "funzione" con tipi e/o numero di parametri diversi, indipendentemente da come ciò è ottenuto

source: **Calling is what matters if defining is not too complicated**
it: **Chiamare è la cosa importante se definire non è troppo complicato**

source: Related constructs
it: Costrutti collegati

source: Generics or templates
it: Generici o template

source: Default arguments
it: Argomenti di default

source: Inheritance (?)
it: Ereditarietà (?)

source: A C++ template example
it: Un esempio con template C++

source: A duck typing example in Python
it: Un esempio di "duck typing" in Python

source: A default arguments example in Python
it: Un esempio in Python con argomenti di default

source: Well...
it: Bé...

source: Overloading is better!
it: L'overload è meglio!

source: It is cleaner
it: E' più pulito

source: It respects the Open/Closed principle
it: Rispetta il principio Aperto/Chiuso

source: Type switches are frowned upon in languages that lack Rust-style enums
it: Gli switch sui tipi sono malvisti nei linguaggi che non hanno gli enum di Rust

source: What about Rust?
it: E Rust?

source: A limited form of overloading may be implemented via traits:
it: Una forma limitata di overload può essere implementata coi trait:

source: The number of parameters cannot vary
it: Il numero di parametri non può variare

source: Implementation is somewhat complicated
it: L'implementazione è un po' più complicata

source: There is a conceptual mismatch: traits provide an additional level of abstraction, overloading should not
it: C'è una discrepanza concettuale: i trait forniscono un livello aggiuntivo di astrazione, l'overload non dovrebbe

source: No default arguments
it: Non supporta gli argomenti di default

source: No duck typing: Rust discourages or prohibits casual completion
it: Non supporta il "duck typing": Rust scoraggia o proibisce il completamento casuale

source: Overloading example in Rust
it: Esempio di overload in Rust

source: Overloading example in Rust (cont.)
it: Esempio di overload in Rust (cont.)

source: Overloading has its problems too!
it: Anche l'overload ha i suoi problemi!

source: Suppose we want to implement a `Point` type that may be built:
it: Supponiamo di voler implementare un tipo `Point` che possa essere costruito:

source: From cartesian coordinates
it: Da coordinate cartesiane

source: From polar coordinates
it: Da coordinate polari

source: A (broken) C++ example
it: Un esempio (errato) in C++

source: Python's default arguments help
it: Gli argomenti di default di Python sono di aiuto

source: Rust to the rescue
it: Rust viene in soccorso

source: ...or how I think overloaded functions should be implemented in Rust:
it: ...o come per me dovrebbero essere implementate le funzioni sovraccaricate in Rust:

source: **A single function with a single enum parameter that lists all the argument combinations to be supported**
it: **Un'unica funzione con un unico parametro enum che elenchi tutte le combinazioni di argomenti da supportare**

source: The Point example in Rust
it: L'esempio del tipo Point in Rust

source: Extending the Point example in Rust
it: Estendiamo l'esempio Point in Rust

source: Extending the Point example in Rust (cont.)
it: Estendiamo l'esempio Point in Rust (cont.)

source: The original example in Rust
it: L'esempio originale in Rust

source: What is bad about it
it: Cosa non va

source: Calling the function is a little more verbose than true overloading
it: Chiamare la funzione è un po' più prolisso dell'overload vero e proprio

source: It breaks the Open/Closed principle: adding supported parameter combinations requires modification of existing code
it: Viola il principio Aperto/Chiuso: aggiungere combinazioni di parametri richiede di modificare codice esistente

source: The argument enum may be somewhat artificial
it: L'enum degli argomenti può risultare un po' artificiale

source: What is good about it
it: Cosa c'è di buono

source: Available alternatives are described in a single place
it: Le alternative disponibili sono descritte in un unico posto

source: Intention is explicitly stated by choosing the appropriate enumeration
it: L'intenzione è espressa esplicitamente attraverso la scelta dell'enumerazione appropriata

source: Rust ensures that all declared cases are covered
it: Rust impone che tutti i casi dichiarati siano gestiti

source: Wait, there's more to it
it: C'è di più

source: A fundamental part of static typing is setting bounds on parameters
it: Un aspetto fondamentale della tipizzazione statica è l'imposizione di vincoli sui parametri

source: Check are better made upfront so that the type system may forward constraints automatically
it: E' meglio fare i controlli subito in modo che il type system inoltri i vincoli automaticamente

source: The argument enum moves argument checking out of the function
it: L'enum degli argomenti sposta il controllo dei parametri fuori dalla funzione

source: This could be extended to further checks:
it: Questo si potrebbe estendere ad altri controlli:

source: Valid subranges
it: Range di validità

source: Combined constraints
it: Vincoli combinati

source: Unfortunately the lack of standard constructors makes the syntax less than ideal
it: Purtroppo la mancanza di costruttori standard rende la sintassi non proprio ideale

source: A last example
it: Un ultimo esempio

source: The end
it: Fine

source: **Q&A or pizza, that is the question!**
it: **Domande o pizza, questo è il dilemma**
